{"world":[{"name":"hub","exits":[{"name":"cave","id":1}],"id":0,"descr":"Straight ahead, you see a cave inside the mountain which you are camping on, since it's starting to turn into a blizzard, your only choice is to go inside the cave. Do c?go cave"},{"name":"cave","exits":[{"name":"aquamarine","id":2},{"name":"deeper-valley","id":3},{"name":"darkcave","id":4}],"id":1,"descr":"As you walked into the cave, the opening to the hub becomes filled with snow, you try your best to dig out, but the weather wins this time. You have three ways to go. To the aquamarine cavern, deeper valley or straight ahead into the dark cave. Use c?go aquamarine c?go deeper-valley or c?go darkcave"},{"name":"aquamarine","exits":[{"name":"cave","id":1},{"name":"aquacorner","id":6}],"id":2,"descr":"You go down into the sparkling ores of aquamarine, if only you made a pickaxe! You hear something around the corner. You can go over there or go back to the cave. use c?go aquacorner or c?go cave"},{"name":"deeper-valley","exits":[{"name":"cave","id":1},{"name":"tunnel","id":9}],"id":3,"descr":"As you stroll into the depths of the valley, you see dead flowers, puddles of sweat, wait, sweat? You hear some breathing into the tunnel ahead, could it be another person? Use c?go tunnel or c?go cave"},{"name":"darkcave","exits":[{"name":"cave","id":1},{"name":"batcave","id":5}],"id":4,"descr":"You slip down into the darker part of the cave. Thankfully you brung a flashlight so you can see. You hear some bats go farther down into the dark cave. At first you thought you were stuck down here, but there's a ladder back up and a sign that says: \"H\". Use c?go cave or c?go batcave"},{"name":"batcave","exits":[{"name":"darkcave","id":4}],"id":5,"descr":"You enter the batcave, since it's modern day, the cave has been deserted and shows no signs of any superhero or anything living here except some stray bats, you may travel back by using c?go darkcave"},{"name":"aquacorner","exits":[{"name":"aquamarine","id":2},{"name":"goldmine","id":7},{"name":"birdshack","id":8}],"id":6,"descr":"The sound grows louder, probably past that door that says bird shack on top... There's also a gold mine on the left that you can check out if you want. You can also head back to the main aquamarine spot, use c?go goldmine c?go birdshack or c?go aquamarine"},{"name":"goldmine","exits":[{"name":"aquacorner","id":6}],"id":7,"descr":"You take a look at all the gold ore, you touch it but it doesn't feel like it's gold. It's only Fool's Gold. You may head back to the aquacorner by using c?go aquacorner"},{"name":"birdshack","exits":[{"name":"aquacorner","id":6}],"id":8,"descr":"You see a bird creature in the corner, they greet you with a happy smile! \"Hello there! I'm one of the hype squad mascots! I'm assuming your lost, so just look around for four signs so you can get into the best place in the world!\" the bird said. You may go back to the aquacorner by using c?go aquacorner"},{"name":"tunnel","exits":[{"name":"deeper-valley","id":3},{"name":"station","id":10}],"id":9,"descr":"Up ahead you hear engine sounds, a lot of them. Perhaps a station. You also see a silhouette up ahead with a hat on. You may use c?go station or c?go deeper-valley"},{"name":"station","exits":[{"name":"tunnel","id":9},{"name":"ironquarry","id":11},{"name":"nitrocastle","id":15},{"name":"village","id":19},{"name":"grandpasscode","id":24}],"id":10,"descr":"A lovely blue fellow with a conductors hat greets you! You also see more of those creatures riding circle shaped ships, You may go to the grand passcode, the iron quarry, nitro castle, underground village or back to the tunnel! Use c?go grandpasscode c?go ironquarry c?go nitrocastle c?go village or c?go tunnel"},{"name":"ironquarry","exits":[{"name":"station","id":10},{"name":"diamondpass","id":12},{"name":"coalmine","id":14}],"id":11,"descr":"You look at the smooth flecked steel on the smooth stone. A big mining operation has happened here, as it goes down and down. There are some other tunnels leading to the Coal Mine or back to the station, you can also get to the diamond mine but it's locked with a passcode. Use c?go coalmine c?go station or c?go diamondpass"},{"name":"diamondpass","exits":[],"id":12,"descr":"The password is a unscrambled version of these letters! \"rbyarve\". Do c?passcode your-answer","passcode":"bravery","rewardroom":"diamondmine"},{"name":"diamondmine","exits":[{"name":"ironquarry","id":11}],"id":13,"descr":"You see the sharp glistening diamonds shining everywhere in the room, a minecart and another one of those ships full of them! You take a few with you for safekeeping. You also see a sign that says \"A\". You may travel back to the iron quarry by using c?go ironquarry"},{"name":"coalmine","exits":[{"name":"ironquarry","id":11}],"id":14,"descr":"As you look at the sad plain black flecks of coal on the stone. You feel like your wasting your time doing all of this stuff. You may travel back to the iron quarry by using c?go ironquarry"},{"name":"nitrocastle","exits":[{"name":"station","id":10},{"name":"paytowin","id":16},{"name":"tavern","id":17}],"id":15,"descr":"The big Nitro Castle, for Nitro users only. Actually since you look familiar you are aloud in. Feel free to go to the \"Pay To Win\" counter or go to the Tavern! You may also go back to the station! Use c?go paytowin c?go station or c?go tavern"},{"name":"paytowin","exits":[{"name":"nitrocastle","id":15}],"id":16,"descr":"You look at all the crazy things happening, everyone seems to be playing games! Nothing important here though, you may go back to the nitrocastle by using c?go nitrocastle"},{"name":"tavern","exits":[{"name":"nitrocastle","id":15}],"id":17,"descr":"Everyone seems to be enjoying themselves and their friends at the Tavern, you see another room, but it's locked with another password! You may enter the password in this room, unscramble this word: \"lcneilriab\". You may use c?passcode your-answer to answer! You can also go back to the nitro castle by using c?go nitrocastle","passcode":"brilliance","rewardroom":"secrettavern"},{"name":"secrettavern","exits":[{"name":"tavern","id":17}],"id":18,"descr":"You have entered a secret part of the tavern, with a desk and another sign that says \"C\", you can go back to the tavern by using c?go tavern"},{"name":"village","exits":[{"name":"station","id":10},{"name":"squirrelshack","id":20},{"name":"slughouse","id":21},{"name":"birdnest","id":22},{"name":"hypeshop","id":23}],"id":19,"descr":"You look around in the underground village, pretty small with a few houses and a hype shop. The houses have signs that say: \"Squirrel's Shack\", \"Slug's House\" and \"Bird's Nest\". You may also go back to the station. You may use c?go hypeshop c?go squirrelshack c?go slughouse c?go birdnest or c?station"},{"name":"squirrelshack","exits":[{"name":"village","id":19}],"id":20,"descr":"You look around in the Squirrel's room you see some banners, nuts, desk, and a bed. Not much here. You can go back to the village by using c?go village"},{"name":"slughouse","exits":[{"name":"village","id":19}],"id":21,"descr":"Plenty of slime everywhere, some more banners, a desk, a bed and a fridge full of lots of food! You may go back to the village by using c?go village"},{"name":"birdnest","exits":[{"name":"village","id":19}],"id":22,"descr":"You see lots of feathers everywhere, a nest, a bed, a desk, a can of worms and a sign that says \"K\". You may go back to the village by using c?go village"},{"name":"hypeshop","exits":[{"name":"village","id":19}],"id":23,"descr":"You look inside the Hype shop, plenty of merch, subscription services and some energy drinks. You can go back to the village by using c?go village"},{"name":"grandpasscode","exits":[{"name":"station","id":10}],"id":24,"descr":"You look at the big passcode, enough letters as the same number of signs in this game. Make sure you've found most of them to figure it out! Do c?passcode your-answer to enter it in! If your not ready yet you can go back to the station by using c?go station. Do note that if you get the passcode correct you won't be going back as you would've finished the game!","passcode":"hack","rewardroom":"wumpushouse"},{"name":"wumpushouse","exits":[],"id":25,"descr":"As you finally arrive at your destination, you see familar photos of yourself, family and friends. You sit down on your bagbean chair and turn on your phone. You check your notifications on discord with your stubby blue hands. You are relieved to be home. Wumpus is now happy. \n\n**THE END!** \n*Thanks for playing!*\n\n If you want to start over you can do c?restart"}],"players":[{"room":"wumpushouse","username":"KeplerTeddy the Dev","id":"374929883698036736","health":20,"inv":[]}]}